# 01 - How to find the version

In [39]:
import pandas as pd
pd.__version__

'1.4.0'

In [40]:
# another way
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : bb1f651536508cdfef8550f93ace7849b00046ee
python           : 3.9.4.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.19041
machine          : AMD64
processor        : Intel64 Family 6 Model 60 Stepping 3, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United States.1252

pandas           : 1.4.0
numpy            : 1.22.1
pytz             : 2021.3
dateutil         : 2.8.2
pip              : 20.2.3
setuptools       : 49.2.1
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.1.1
IPython          : 8.0.1
pandas_datareader: None
bs4              : 4.11.1
bottleneck       : None
fastparquet      : None
fsspec           : None
gcsfs            : None
matplotlib       : 3.5.1
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : 3.0.10
pandas_gbq       : None
pyarrow          : 7.0.0
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : 1.7.3
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
zstandard        : None

# 02- Make a dataframe

In [41]:
df = pd.DataFrame({'A col': [1, 2, 3], 'B col' : [4, 5, 6]})
df

   A col  B col
0      1      4
1      2      5
2      3      6

In [42]:
# Numpy array use to creat dataframe
import numpy as np
arr = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
pd.DataFrame(arr)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [43]:
# Numpy array dataframe
pd.DataFrame(np.random.rand(4,8))

,0,1,2,3,4,5,6,7
0,0.307128,0.815127,0.491596,0.305610,0.979680,0.972643,0.974110,0.638112
1,0.596671,0.297165,0.148457,0.116921,0.058536,0.280884,0.620588,0.113555
2,0.287825,0.833324,0.418218,0.025949,0.894667,0.590995,0.954784,0.601886
3,0.435586,0.232733,0.110155,0.559171,0.705925,0.676251,0.045719,0.291462

In [44]:
pd.DataFrame(np.random.rand(4,8), columns=list('ABCDEFGH'))

,A,B,C,D,E,F,G,H
0,0.985118,0.817438,0.316517,0.863079,0.657503,0.259883,0.132133,0.313272
1,0.566821,0.943695,0.191632,0.140145,0.333591,0.508502,0.348491,0.099968
2,0.214145,0.119321,0.375718,0.864806,0.591827,0.767768,0.639435,0.162505
3,0.431202,0.620893,0.639323,0.358451,0.009381,0.701696,0.028159,0.994345

# How to rename columns?

In [45]:
df = pd.DataFrame({'A col': [1, 2, 3,6,5,6,8,9], 'B col' : [4, 5, 6,5,8,7,7,9]})
df

   A col  B col
0      1      4
1      2      5
2      3      6
3      6      5
4      5      8
5      6      7
6      8      7
7      9      9

In [46]:
df.rename(columns={'A col': 'col_A', 'B col': 'col_B'}, inplace=True)
df

   col_A  col_B
0      1      4
1      2      5
2      3      6
3      6      5
4      5      8
5      6      7
6      8      7
7      9      9

In [47]:
# remane columns
df.columns=['col_aa', 'col_bb']
df

   col_aa  col_bb
0       1       4
1       2       5
2       3       6
3       6       5
4       5       8
5       6       7
6       8       7
7       9       9

In [48]:
# to replace any character, string
df.columns=df.columns.str.replace('_', ' ')
df

   col aa  col bb
0       1       4
1       2       5
2       3       6
3       6       5
4       5       8
5       6       7
6       8       7
7       9       9

In [49]:
# Adding prefix to columns
df = df.add_prefix('ahsan')
df

   ahsancol aa  ahsancol bb
0            1            4
1            2            5
2            3            6
3            6            5
4            5            8
5            6            7
6            8            7
7            9            9

In [50]:
# adding suffix to col
df = df.add_suffix('_zaman')
df

   ahsancol aa_zaman  ahsancol bb_zaman
0                  1                  4
1                  2                  5
2                  3                  6
3                  6                  5
4                  5                  8
5                  6                  7
6                  8                  7
7                  9                  9

In [51]:
df.columns = ['col_a', 'col_b']
df

   col_a  col_b
0      1      4
1      2      5
2      3      6
3      6      5
4      5      8
5      6      7
6      8      7
7      9      9

# Using template data

In [52]:
import pandas as pd
import numpy as np
import seaborn as sns

ship = sns.load_dataset('titanic')
ship.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [53]:
# Summary
df.describe()

          col_a     col_b
count  8.000000  8.000000
mean   5.000000  6.375000
std    2.828427  1.685018
min    1.000000  4.000000
25%    2.750000  5.000000
50%    5.500000  6.500000
75%    6.500000  7.250000
max    9.000000  9.000000

In [54]:
# Columns name
ship.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [55]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\quantum\appdata\local\programs\python\python39\lib\site-packages (3.0.10)
Requirement already satisfied: et-xmlfile in c:\users\quantum\appdata\local\programs\python\python39\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 20.2.3; however, version 22.2.2 is available.
You should consider upgrading via the 'c:\Users\Quantum\AppData\Local\Programs\Python\Python39\python.exe -m pip install --upgrade pip' command.

In [56]:
# Saving datasets
ship.to_csv('ship.csv')
ship.to_excel('ship.xlsx')

# Using your own Data

In [57]:
import pandas as pd
df = pd.read_csv('ship.csv')
df.head()

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [58]:
df = pd.read_excel('ship.xlsx')
df.head()

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# Reverse row Order

In [59]:
import seaborn as sns
import pandas as pd

ship = sns.load_dataset('titanic')
df.head()

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [60]:
df.loc[::-1].head()

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
889,889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
888,888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
887,887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
886,886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

In [61]:
df.loc[::-1].reset_index(drop=True).head()

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
1,889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
2,888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
3,887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
4,886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

# Reverse Column Order

In [62]:
df.loc[:, ::-1].head()

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived,Unnamed: 0
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1,2
3,False,yes,Southampton,C,False,woman,First,S,53.1000,0,1,35.0,female,1,1,3
4,True,no,Southampton,NaN,True,man,Third,S,8.0500,0,0,35.0,male,3,0,4

# Select a column by dtype

In [63]:
ship.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [64]:
# Only select those having Numaric type
ship.select_dtypes(include=['number']).head()

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [65]:
# Only select those having Object type
ship.select_dtypes(include=['object']).head()

      sex embarked    who  embark_town alive
0    male        S    man  Southampton    no
1  female        C  woman    Cherbourg   yes
2  female        S  woman  Southampton   yes
3  female        S  woman  Southampton   yes
4    male        S    man  Southampton    no

In [66]:
# Only select those having multiple type
ship.select_dtypes(include=['object','number', 'category']).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,deck,embark_town,alive
0,0,3,male,22.0,1,0,7.2500,S,Third,man,NaN,Southampton,no
1,1,1,female,38.0,1,0,71.2833,C,First,woman,C,Cherbourg,yes
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,NaN,Southampton,yes
3,1,1,female,35.0,1,0,53.1000,S,First,woman,C,Southampton,yes
4,0,3,male,35.0,0,0,8.0500,S,Third,man,NaN,Southampton,no

In [67]:
ship.select_dtypes(exclude=['object']).head()

,survived,pclass,age,sibsp,parch,fare,class,adult_male,deck,alone
0,0,3,22.0,1,0,7.2500,Third,True,NaN,False
1,1,1,38.0,1,0,71.2833,First,False,C,False
2,1,3,26.0,0,0,7.9250,Third,False,NaN,True
3,1,1,35.0,1,0,53.1000,First,False,C,False
4,0,3,35.0,0,0,8.0500,Third,True,NaN,True

# Convert Strings into Numbers

In [68]:
df = pd.DataFrame({'A col': ['1', '2', '3','6','5', '6', '8' ,'9'], 
                    'B col' : ['4', '5', '6' , '5' , '8', '7', '7', '9']})
df

  A col B col
0     1     4
1     2     5
2     3     6
3     6     5
4     5     8
5     6     7
6     8     7
7     9     9

In [69]:
df.dtypes

A col    object
B col    object
dtype: object

In [75]:
df.astype({'A col': 'float64', 'B col': 'int64'}).dtypes

A col    float64
B col      int64
dtype: object

In [77]:
pd.to_numeric(df['A col'], errors='coerce')

0    1
1    2
2    3
3    6
4    5
5    6
6    8
7    9
Name: A col, dtype: int64

# Reduce data frame size

In [78]:
df = sns.load_dataset('titanic')
df.shape

(891, 15)

In [79]:
df.sample(frac=0.1).shape

(89, 15)